ch32-rs/ch32-rs/svd/fixed/ch32v2.svd
			<register>
				<name>R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL</name>
				<description>endpoint 2 control</description>
				<addressOffset>0x3b</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_R_RES___USBHD_UH_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_R_TOG___USBHD_UH_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG___USBHD_UH_R_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP3_T_LEN__USBHD_UH_TX_LEN</name>
				<description>endpoint 3 transmittal length</description>
				<addressOffset>0x3c</addressOffset>
				<size>8</size>
				<access>read-write</access>
				</register>
			<register>
				<name>R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL</name>
				<description>endpoint 3 control</description>
				<addressOffset>0x3e</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES___USBHD_UH_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_T_TOG___USBHD_UH_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP3_R_CTRL_</name>
				<description>endpoint 3 control</description>
				<addressOffset>0x3f</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>

			<register>
				<name>R8_UEP4_T_LEN</name>
				<description>endpoint 4 transmittal length</description>
				<addressOffset>0x40</addressOffset>
				<size>8</size>
				<access>read-write</access>
				</register>
			<register>
				<name>R8_UEP4_T_CTRL</name>
				<description>endpoint 4 control</description>
				<addressOffset>0x42</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_T_TOG___USBHD_UH_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP4_R_CTRL_</name>
				<description>endpoint 4 control</description>
				<addressOffset>0x43</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>

			<register>
				<name>R8_UEP5_T_LEN</name>
				<description>endpoint 5 transmittal length</description>
				<addressOffset>0x44</addressOffset>
				<size>8</size>
				<access>read-write</access>
				</register>
			<register>
				<name>R8_UEP5_T_CTRL</name>
				<description>endpoint 5 control</description>
				<addressOffset>0x46</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_T_TOG___USBHD_UH_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP5_R_CTRL_</name>
				<description>endpoint 5 control</description>
				<addressOffset>0x47</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>

			<register>
				<name>R8_UEP6_T_LEN</name>
				<description>endpoint 6 transmittal length</description>
				<addressOffset>0x48</addressOffset>
				<size>8</size>
				<access>read-write</access>
				</register>
			<register>
				<name>R8_UEP6_T_CTRL</name>
				<description>endpoint 6 control</description>
				<addressOffset>0x4a</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_T_TOG___USBHD_UH_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP6_R_CTRL_</name>
				<description>endpoint 6 control</description>
				<addressOffset>0x4b</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP7_T_LEN</name>
				<description>endpoint 7 transmittal length</description>
				<addressOffset>0x4c</addressOffset>
				<size>8</size>
				<access>read-write</access>
				</register>
			<register>
				<name>R8_UEP7_T_CTRL</name>
				<description>endpoint 7 control</description>
				<addressOffset>0x4e</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_T_TOG___USBHD_UH_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>R8_UEP7_R_CTRL_</name>
				<description>endpoint 7 control</description>
				<addressOffset>0x4f</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USBHD_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>USB_OTG_CR</name>
				<description>usb otg control</description>
				<addressOffset>0x54</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>USB_OTG_CR_DISCHARGEVBUS</name>
						<description>usb otg control</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>USB_OTG_CR_CHARGEVBUS</name>
						<description>usb otg control</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>USB_OTG_CR_IDPU</name>
						<description>usb otg control</description>
						<bitRange>[2:2]</bitRange>
					</field>
						<field>
						<name>USB_OTG_CR_OTG_EN</name>
						<description>usb otg control</description>
						<bitRange>[3:3]</bitRange>
					</field>
						<field>
						<name>USB_OTG_CR_VBUS</name>
						<description>usb otg control</description>
						<bitRange>[4:4]</bitRange>
					</field>
						<field>
						<name>USB_OTG_CR_SESS</name>
						<description>usb otg control</description>
						<bitRange>[5:5]</bitRange>
					</field>
				</fields>
				</register>
			<register>
				<name>USB_OTG_SR</name>
				<description>usb otg status</description>
				<addressOffset>0x58</addressOffset>
				<size>0x20</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>USB_OTG_SR_VBUS_VLD</name>
						<description>usb otg status</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>USB_OTG_SR_SESS_VLD</name>
						<description>usb otg status</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>USB_OTG_SR_SESS_END</name>
						<description>usb otg status</description>
						<bitRange>[2:2]</bitRange>
					</field>
						<field>
						<name>USB_OTG_SR_ID_DIG</name>
						<description>usb otg status</description>
						<bitRange>[3:3]</bitRange>
					</field>
					</fields>
				</register>
